[{"username":"happy","password":"12","name":"HappyTester","lastLogin":1565231945484,"currentLogin":1565240970721,"lastLoginString":"2019/08/07 - 19:39","noteCount":6,"list":[{"title":"Apple","noteId":1,"type":"file","lastUpdate":"","create":"172837283","note":"Donec id elit non mi porta gravida at eget metus. Fusce dapibus, tellus ac cursus commodo."},{"title":"Banana","noteId":2,"type":"file","lastUpdate":"1643361211","create":"172837283","note":"Donec id elit non mi porta gravida at eget metus. Fusce dapibus, tellus ac cursus commodo, tortor mauris condimentum nibh, ut fermentum massa justo sit amet risus, tortor mauris condimentum nibh, ut fermentum massa justo sit amet risus tortor mauris condimentum nibh, ut fermentum massa justo sit amet risus tortor mauris condimentum nibh, ut fermentum massa justo sit amet risus"},{"title":"Cat","noteId":3,"type":"file","lastUpdate":null,"create":"172837283","note":"Donec id elit non mi porta gravida at eget metus. Fusce dapibus, tellus ac cursus commodo, tortor mauris condimentum nibh, ut fermentum massa justo sit amet risus tortor mauris condimentum nibh, ut fermentum massa justo sit amet risus tortor mauris condimentum nibh, ut fermentum massa justo sit amet risus tortor mauris condimentum nibh, ut fermentum massa justo sit amet risus tortor mauris condimentum nibh, ut fermentum massa justo sit amet risus tortor mauris condimentum nibh, ut fermentum massa justo sit amet risus"},{"title":"Dog","noteId":4,"type":"file","lastUpdate":"","create":"172837283","note":"Donec id elit "},{"title":"OAuth","noteId":5,"type":"file","lastUpdate":"2019/08/07 - 22:14","create":"172837283","note":"OAuth (formally specified by RFC 5849) provides a means for users to grant third-party applications access to their data without exposing their password to those applications.\n\nThe protocol greatly improves the security of web applications, in particular, and OAuth has been important in bringing attention to the potential dangers of exposing passwords to external services.\n\nWhile OAuth 1.0 is still widely used, it has been superseded by OAuth 2.0. It is recommended to base new implementations on OAuth 2.0."},{"title":"Passport.js","noteId":6,"type":"file","lastUpdate":null,"create":"2019/08/07 - 22:05","note":"Passport is authentication middleware for Node. It is designed to serve a singular purpose: authenticate requests. When writing modules, encapsulation is a virtue, so Passport delegates all other functionality to the application. This separation of concerns keeps code clean and maintainable, and makes Passport extremely easy to integrate into an application."}],"settings":{"noteOrderName":"Name","noteOrderDirection":"down","noteDisplay":"list"}},{"username":"abc","password":"12","name":"Alex","lastLogin":1565231775960,"currentLogin":1565231835180,"lastLoginString":"2019/08/07 - 19:36","noteCount":7,"list":[{"title":"AAAAAAAA","noteId":1,"type":"file","lastUpdate":"2019/08/07 - 19:38","create":"172837283","note":"If this value is not a promise, including undefined, it becomes the fulfillment value of the associated promise. If this value is a promise, then the associated promise will be resolved to the passed promise, and follow the state as the provided promise (including any future transitions)."},{"title":"Banana","noteId":2,"type":"file","lastUpdate":"1643361211","create":"172837283","note":"Donec id elit non mi porta gravida at eget metus. Fusce dapibus, tellus ac cursus commodo, tortor mauris condimentum nibh, ut fermentum massa justo sit amet risus, tortor mauris condimentum nibh, ut fermentum massa justo sit amet risus tortor mauris condimentum nibh, ut fermentum massa justo sit amet risus tortor mauris condimentum nibh, ut fermentum massa justo sit amet risus"},{"title":"coffee","noteId":3,"type":"file","lastUpdate":null,"create":"2019/08/07 - 13:08","note":"The request was valid, but the server is refusing action. The user might not have the necessary permissions for a resource, or may need an account of some sort. This code is also typically used if the request provided authentication via the WWW-Authenticate header field, but the server did not accept that authentication."},{"title":"A Day","noteId":4,"type":"file","lastUpdate":null,"create":"2019/08/07 - 13:11","note":"This class of status code is intended for situations in which the error seems to have been caused by the client. Except when responding to a HEAD request, the server should include an entity containing an explanation of the error situation, and whether it is a temporary or permanent condition. These status codes are applicable to any request method."},{"title":"Three","noteId":5,"type":"file","lastUpdate":null,"create":"2019/08/07 - 13:11","note":"mememem"},{"title":"Four","noteId":6,"type":"file","lastUpdate":null,"create":"2019/08/07 - 13:23","note":"four\nfour\nfour"},{"title":"HHHH","noteId":7,"type":"file","lastUpdate":"2019/08/07 - 18:54","create":"2019/08/07 - 14:06","note":"hhhhhhhh\nhhhhhhhhh"}],"settings":{"noteOrderName":"Name","noteOrderDirection":"down","noteDisplay":"list"}}]